<a href="https://colab.research.google.com/github/rojan-herald/concepts_and_technologies_of_ai/blob/main/Worksheet3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

3.1 Warm Up Exercises:
1. Sorting and Subsetting:

In [ ]:
df=pd.read_csv("/content/drive/MyDrive/Concepts and technologies of AI/Titanic-Dataset.csv")
dataframe= pd.DataFrame(df)
df.info()
df.head(1)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

Problem 1 - Sorting:

In [ ]:
#1Create a DataFrame called fare that contains only the Fare column of the Titanic dataset. Print the
#head of the result.
fare_only= dataframe[["Fare"]]
fare_only.head()

#2Create a DataFrame called class age that contains only the Pclass and Age columns of the Titanic
#dataset, in that order. Print the head of the result.
class_age = df[['Pclass', 'Age']]
print(class_age.head())

#3. Create a DataFrame called survived gender that contains the Survived and Sex columns of the
#Titanic dataset, in that order.Print the head of the result.
survived_gender = df[['Survived', 'Sex']]
print(survived_gender.head())

   Pclass   Age
0       3  22.0
1       1  38.0
2       3  26.0
3       1  35.0
4       3  35.0
   Survived     Sex
0         0    male
1         1  female
2         1  female
3         1  female
4         0    male

Problem - 2 - Subsetting:

Subsetting Rows:

In [ ]:
#1 Filter the Titanic dataset for cases where the passenger’s fare is greater than 100, assigning it
#to fare gt 100.View the printed result.

# fare_gt_100= dataframe[dataframe["Fare"]>100]
# print(fare_gt_100.head(3))

#2Filter the Titanic dataset for cases where the passenger’s class (Pclass) is 1, assigning it to
#first class.View the printed result.
# first_class= dataframe[dataframe["Pclass"]==1]
# print(first_class)


#3 Filter the Titanic dataset for cases where the passenger’s age is less than 18 and the passenger
#is female (Sex is "female"), assigning it to female under 18. View the printed result.
female_under_18= dataframe[(dataframe["Age"]<18) & (dataframe["Sex"]=="female")]
print(female_under_18.head())

    PassengerId  Survived  Pclass                                  Name  \
9            10         1       2   Nasser, Mrs. Nicholas (Adele Achem)
10           11         1       3       Sandstrom, Miss. Marguerite Rut
14           15         0       3  Vestrom, Miss. Hulda Amanda Adolfina
22           23         1       3           McGowan, Miss. Anna "Annie"
24           25         0       3         Palsson, Miss. Torborg Danira

       Sex   Age  SibSp  Parch   Ticket     Fare Cabin Embarked
9   female  14.0      1      0   237736  30.0708   NaN        C
10  female   4.0      1      1  PP 9549  16.7000    G6        S
14  female  14.0      0      0   350406   7.8542   NaN        S
22  female  15.0      0      0   330923   8.0292   NaN        Q
24  female   8.0      3      1   349909  21.0750   NaN        S

Subsetting Rows by Categorical variables:

In [ ]:
#1. Filter the Titanic dataset for passengers whose Embarked port is either "C" (Cherbourg) or "S"
#(Southampton#), assigning the result to embarked c or s. View the printed result.

# embarked_c_s= dataframe[(dataframe["Embarked"]=="C") | (dataframe["Embarked"]=="S")]
# print(embarked_c_s.head(4))

#2 2. Filter the Titanic dataset for passengers whose Pclass is in the list [1, 2] (indicating first
#or second class),assigning the result to first second class.View the printed result.

first_second_class= dataframe[dataframe["Pclass"].isin([1,2])]
print(first_second_class.head())

    PassengerId  Survived  Pclass  \
1             2         1       1
3             4         1       1
6             7         0       1
9            10         1       2
11           12         1       1

                                                 Name     Sex   Age  SibSp  \
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
6                             McCarthy, Mr. Timothy J    male  54.0      0
9                 Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1
11                           Bonnell, Miss. Elizabeth  female  58.0      0

    Parch    Ticket     Fare Cabin Embarked
1       0  PC 17599  71.2833   C85        C
3       0    113803  53.1000  C123        S
6       0     17463  51.8625   E46        S
9       0    237736  30.0708   NaN        C
11      0    113783  26.5500  C103        S

3.2 Exploratory Data Analysis Practice Exercise - 1.

In [ ]:
#Add a column to the Titanic dataset, fare per year, containing the fare divided by the age of
#the passenger(i.e., Fare/Age).
median_age = dataframe['Age'].median()
dataframe['Age'] = dataframe['Age'].fillna(median_age)
dataframe['fare_per_year']= dataframe['Fare']/dataframe['Age']
print(dataframe.head(6))

#2. Subset rows where fare per year is higher than 5, assigning this to high fare age.
high_fare_age= dataframe[dataframe['fare_per_year']>5]
# print(high_fare_age)

#3. Sort high fare age by descending fare per year, assigning this to high fare age srt.
high_fare_age_srt= high_fare_age.sort_values(by='fare_per_year',ascending=False)
# print(high_fare_age_srt.head(5))

#4. Select only the Name and fare per year columns of high fare age srt and save the result as result.
result = high_fare_age_srt[["Name", "fare_per_year"]]
print(result.head())

#Allison, Master. Hudson Trevor has had the highest fare paid relative to age

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3
5            6         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0
5                                   Moran, Mr. James    male  28.0      0

   Parch            Ticket     Fare Cabin Embarked  fare_per_year  \
0      0         A/5 21171   7.2500   NaN        S       0.329545
1      0          PC 17599  71.2833   C85        C       1.875876
2      0  STON/O2. 3101282   7.9250   NaN        S       0.304808
3      0            113803  53.1000  C123        S       1.517143
4      0            373450   8.0500   NaN        S       0.230000
5      0            330877   8.4583   NaN        Q       0.302082

   fare per class  fare_per_class
0        2.416667        2.416667
1       71.283300       71.283300
2        2.641667        2.641667
3       53.100000       53.100000
4        2.683333        2.683333
5        2.819433        2.819433
                                Name  fare_per_year
305   Allison, Master. Hudson Trevor     164.728261
297     Allison, Miss. Helen Loraine      75.775000
386  Goodwin, Master. Sidney Leonard      46.900000
164     Panula, Master. Eino Viljami      39.687500
183        Becker, Master. Richard F      39.000000

Which adult male passenger (age ≥ 18 and Sex is ’male’) paid the highest fare relative to their
class?

In [ ]:
#Add a column to the Titanic dataset, fare per year, containing the fare divided by the age ofthe passenger(i.e., Fare/Age).
dataframe['fare_per_class']= dataframe['Fare']/dataframe['Pclass']
# dataframe.head()

# 2. Subset rows where the passenger is male (Sex is ”male”) and an adult (Age is greater than or equalto 18), assigning this to adult males.
adult_males= dataframe[(dataframe["Age"]>=18) & (dataframe["Sex"]=="male")]
# print(adult_males.head())

#3. Sort adult males by descending fare per class, assigning this to adult males srt.
adult_males_srt= adult_males.sort_values(by="fare_per_class",ascending=False)
# print(adult_males_srt.head(6))

#Select only the Name, Age, and fare per class columns of adult males sr and save the results result.
result= adult_males_srt[["Name","Age","fare_per_class"]]
print(result.head(6))

                                                Name   Age  fare_per_class
0                            Braund, Mr. Owen Harris  22.0        2.416667
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0       71.283300
2                             Heikkinen, Miss. Laina  26.0        2.641667
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0       53.100000
4                           Allen, Mr. William Henry  35.0        2.683333
5                                   Moran, Mr. James  28.0        2.819433

#3.3 Exploratory Data Analysis with Group-by Method Practice Exercise:

In [ ]:
#1. Calculate the total Fare paid across all passengers in the Titanic dataset.
total_fare= dataframe['Fare'].sum()
print(f"the total sum of fare column is {total_fare}")


#2. Subset for passengers in first class (Pclass is 1) and calculate their total fare.
pclassones = dataframe.loc[dataframe["Pclass"] == 1, "Fare"].sum()
print(f"Total Fare paid by first-class passengers: {pclassones}")

#Do the same for second class (Pclass is 2) and third class (Pclass is 3).
totalpclass2_3= dataframe.loc[dataframe["Pclass"].isin([2,3]),"Fare"].sum()
print(f"total fare paid by 2 and 3 is {totalpclass2_3}")

#4. Combine the fare totals from first, second, and third classes into a list.
# fare_total= total_fare.tolist();
# print(fare_total)

#5. Divide the totals for each class by the overall total fare to get the proportion of fare revenue by class.

one = pclassones/total_fare
threeandtwo = totalpclass2_3/total_fare
print(f"the proportion for class 1 is {one}")
print(f"the proportion for class 2 and class 3 is {threeandtwo}")

the total sum of fare column is 28693.9493
Total Fare paid by first-class passengers: 18177.4125
total fare paid by 2 and 3 is 10516.536799999998
the proportion for class 1 is 0.6334928771899656
the proportion for class 2 and class 3 is 0.3665071228100343

What percent of the total number of passengers on the Titanic belonged to each age group
(e.g., child, adult, senior)?

In [ ]:
dataframe['age_group'] = 'adult'   # default

dataframe.loc[dataframe['Age'] < 18, 'age_group'] = 'child'
dataframe.loc[dataframe['Age'] >= 65, 'age_group'] = 'senior'
# dataframe.head()

#2. Calculate the total number of passengers on the Titanic.
totalpassenger= dataframe["PassengerId"].count()
print(f"there are {totalpassenger} passenger in titanic")

#3. Count the number of passengers in each age group.
age_group_counts = dataframe['age_group'].value_counts()
print(age_group_counts)
print("_______________________________________________________")

#4. Divide the count of each age group by the total number of passengers to get the proportion of passengersin each age group.

proportion = age_group_counts / totalpassenger
print(f"the proportion for each group is \n {proportion}")
print("_______________________________________________________")
#5. Display the proportion as a percentage.
intopercentage= proportion*100
print(f"into percentage is {intopercentage}")

there are 891 passenger in titanic
age_group
adult     767
child     113
senior     11
Name: count, dtype: int64
_______________________________________________________
the proportion for each group is
 age_group
adult     0.860831
child     0.126824
senior    0.012346
Name: count, dtype: float64
_______________________________________________________
into percentage is age_group
adult     86.083053
child     12.682379
senior     1.234568
Name: count, dtype: float64